function print_FoZu()
% 
for  i=1:10
    fprintf('            佛祖保佑       永无BUG             \n')
    fprintf('^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n');
    fprintf('\n');
    fprintf('                   _ooOoo_                  \n');
    fprintf('                  o8888888o                 \n');
    fprintf('                  88" . "88                 \n');
    fprintf('                  (| -_- |)                 \n');
    fprintf('                  O\\  =  /O                \n');
    fprintf('               ____/`---''\\____             \n');
    fprintf('             .''  \\\\|     |//  `.           \n');
    fprintf('            /  \\\\|||  :  |||//  \\          \n');
    fprintf('           /  _||||| -:- |||||-  \\         \n');
    fprintf('           |   | \\\\  -  // |   |          \n');
    fprintf('           | \\_|  ''''\\---/''  |   |          \n');
    fprintf('           \\  .-\\__  `-`  ___/-. /        \n');
    fprintf('         ___`. .''  /--.--\\  `. . __       \n');
    fprintf('      ."" ''<  `.___\\_<|>_/___.''  >''"".\n');
    fprintf('     | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |       \n');
    fprintf('     \\  \\ `-.   \\_ __\\ /__ _/   .-` /  /  \n');
    fprintf('======`-.____`-.___\\_____/___.-`____.-''======\n');
    fprintf('                   `=---=''                    \n');
    fprintf('^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n');
    fprintf('            佛祖保佑       永无BUG             \n');
pause(1)
end

end